
/*
 TPOSApiClient.m
 */
"unknown_error"="未知异常";
"unknown_data_type"="返回数据类型错误";

/*
 TPOSGuideViewController.m
 */
"self_controlled"="自我掌控资产";
"p2p_trans"="点对点自由转账";
"dapps_browser"="DApps 浏览器";
"easy_trade"="轻松交易资产";
"welcome_2"="欢迎来到新世界";
"enter_tp"="进入 Token Pocket";

/*
 TPOSTabBarController.m
 */
"Assets"="资产";
"Markets"="行情";
"Discover"="发现";
"Profile"="我的";
"Exchanges"="交易";

/*
 TPOSCustomMJRefreshFooter.m
 */
"reach_bottom"="哎呀，到底了";
"slide_load_more"="上滑加载更多";
"loading_more"="正在加载更多...";

/*
 TPOSCameraUtils.m
 */
"warm_tip"="温馨提示";
"camera_setting_tips"="请去-> [设置 - TokenPocket - 相机] 打开访问开关";
"confirm"="确定";
"album_access_failed"="因为系统原因, 无法访问相册";
"no_camera"="未检测到您的摄像头";

/*
 NSDate+TPOS.m
 */
"just_now"="刚刚";
"one_min_ago"="分钟前";
"n_min_ago"="分钟前";
"one_h_ago"="小时前";
"n_h_ago"="小时前";
"one_day_ago"="天前";
"n_day_ago"="天前";
"one_m_ago"="月前";
"n_m_ago"="月前";
"one_y_ago"="年前";
"n_y_ago"="年前";

"trans_record"="交易记录";
"trans_succ"="交易成功";
"trans_fail"="交易失败";
"transing"="交易处理中";
"copy_to_board"="已复制到粘贴板";
"trans_query"="交易查询";
"trans_detail"="交易详情";

"transaction"="转账";
"has_error"="发生错误";
"package_fail"="打包失败";
"packaging"="已提交，打包中";
"trans_suc"="转账成功";
"trans_fai"="转账失败";
"choose_token"="请选择token";
"missing_wallet_addr"="请输入钱包地址";
"missing_trans_amount"="请输入转账数量";
"trans_to_self"="不能给自己转账";
"wrong_addr_tips"="请输入正确的钱包地址";
"no_enough_token"="余额不足";
"next_step"="下一步";
"token_trans"="转账代币";
"choose_token"="请选择代币";
"wallet_addr"="钱包地址";
"input_paste_addr"="输入或粘贴钱包地址";

"trans_amount"="转账数量";
"input_out_amount"="输入转出金额";
"miner_fee"="矿工费";
"select_fee"="请选择矿工费";
"comment"="备注";
"trans_num"="交易号";
"blc_num"="区块高度";
"trans_time"="交易时间";
"copy_url"="复制URL";
"choose_token_trans"="选择代币转账";

"req_exchange_list_fail"="拉取交易列表失败";

"add_new_tokens"="添加新资产";
"wrong_and_try_later"="出错了，请稍后重试";
"all"="全部";


"receive"="收款";
"receiver"="收款方";
"copied"="已复制";
"copy_wallet_addr"="复制收款地址";
"rece_amount"="收款金额";
"set_rec_amount"="请设置收款金额";

"cannot_recog_qrcode"="暂未识别出扫描的二维码";
"align_qrcode"="将二维码放入框内, 即可自动扫描";
"album"="相册";
"scan"="扫一扫";

"input_asset_name"="请输入资产名称";
"cancel"="取消";
"confirm"="确认";
"hot_coin"="热门代币";
"coming_soon"="详情即将上线，敬请期待";

"add_tokens"="添加资产";
"support_token_tip"="支持SWTC等区块链资产一站式管理";
"all_wallet"="全部钱包";
"no_wallet_tips"="您当前还没有钱包哦，快去创建吧~";
"ok"="好的";

"how_to"="如何设置参数？";
"advanced"="高级选项";

"custom_gas_price"="自定义 Gas Price";
"custom_gas"="自定义 Gas";

/*
 TPOSTransactionConfirmView.m
 */
"input_pwd"="请输入密码";
"confirm"="确认";

/*
 TPOSAssetHeader.m
 */
"my_asset"="我的资产";

/*
 TPOSAssetPopWindow.m
 */
"create_wallet"="创建钱包";

/*
 TPOSSearchTokenCell.m
 */
"added"="已添加";
"add"="添加";

/*
 TPOSAssetCreateWalletView.m
 */
"all_wallet"="全部钱包";
"has_no"="未创建";
"wallet"="钱包";
"s_wallet"="的钱包";
"s_only_token_chain"="的数字代币只能存放在该体系的钱包中";

/*
 TPOSDiscoveryViewController.m
 */
"dapp_recomd"="Dapp推荐";
"hot_articles"="热门与文章";

/*
 TPOSExchangeWalletVewController.m
 */
"switch_account"="切换账户";

/*
 TPOSMineViewController.m
 */
"personal_center"="个人中心";
"msg"="消息中心";
"contact"="联系人";
"help"="帮助中心";
"about"="关于我们";
"settings"="系统设置";

/*
 TPOSEditWalletViewController.m
 */
"saving"="保存中..";
"save_succ"="保存成功";
"save_fail"="保存失败";
"save"="保存";
"delete_caution"="请谨慎，此操作无法撤销";
"delete_succ"="删除成功";
"delete_fail"="删除失败";
"pwd_error"="密码错误";
"pwd_not_match"="密码不一致，请重试";

/*
 TPOSSettingViewController.m
 */
"login_pwd"="密码登录";
"login_faceid"="面部识别";
"login_touchid"="指纹识别";
"language"="多语言";
"currency_unit"="货币单位";
"web3_setting"="web3设置";
"set"="设置";
"cancel"="取消";

/*
 TPOSMessageCenterViewController.m
 */
"read_all"="全部已读";

/*
 TPOSMemonicImportWalletViewController.m
 */
"custom_path"="自定义路径";
"service_privacy"="服务及隐私条款";
"pwd_not_match"="密码不一致，请确认后再输入";
"importing"="导入中..";
"m_new_wallet"="M-新钱包";
"import_succ"="导入成功";
"import_fail"="导入失败";

/*
 TPOSPrivateKeyImportWalletViewController.m
 */
"term_service"="服务协议";
"wallet_exist"="钱包已存在";
"pk_wallet"="PK-新钱包";

/*
 TPOSChooseTokenSystemViewController.m
 */
"choose_blc_type"="选择币种体系";
"created"="已创建";
"blc_type_wallet"="体系钱包";

/*
 TPOSImportWalletViewController.m
 */
"import_wallet"="导入钱包";
"mnemonic"="助记词";
"pri_key"="私钥";

/*
 TPOSCreateMemonicViewController.m
 */
"backup_mnem"="备份助记词";
"backup_mnem_tips"="助记词用于恢复钱包或重置钱包密码，将它准确的抄写在纸上，并存放在只有你知道的安全的地方。";

/*
 TPOSConfirmMemonicViewController.m
 */
"confirm_result"="验证结果";
"reconfirm_mnemonic"="助记词顺序验证错误，请重新确认";
"backup_succ"="备份成功";

/*
 TPOSCreateWalletViewController.m
 */
"choose_wallet_chain_type"="请选择钱包体系";
"complete_info"="请填写完整的信息";
"at_least_8"="密码不可少于8位";
"pwd_not_match"="两次输入密码不一致";
"read_and_agree"="请阅读并同意服务及隐私条款";
"tips"="提示";
"create_succ"="创建钱包成功";
"create_fail"="创建钱包失败";

/*
 TPOSBackupWalletViewController.m
 */
"backup_wallet"="备份钱包";

/*
 TPOSSelectChainTypeViewController.m
 */
"choose_blc_type"="选择钱包体系";
"chain_info_retry"="体系信息获取失败，请重试";
"already_wallet"="无法导入,您已创建";

/*
 TPOSWalletManagerViewController.m
 */
"wallet_manage"="钱包管理";
"total_asset"="资产总览";

/*
 TPOSAboutUsViewController.m
 */
"pri_policy"="隐私策略";
"ver_release"="版本日志";
"check_update"="检测新版";
"app_guide"="产品向导";

/*
 TPOSEditPasswordViewController.m
 */
"modify_succ"="修改成功";
"change_pwd"="更改密码";
"done"="完成";

/*
 TPOSMessageCenterCell.m
 */
"receiver"="接收方";
"trans_succ"="转账成功";
"trans_noti"="转账通知";
"sender"="发送方";

/*
 TPOSChooseTokenSystemCell.m
 */
"blc_type"="体系";

/*
 TPOSPasswordView.m
 */
"weak"="弱";
"normal"="一般";
"good"="很好";
"safe"="安全";

/*
 TPOSAboutUsCell.m
 */
"curr_version"="当前版本：";

/*
 TPOSWalletChainCell.m
 */
"created"="已创建";

/*
 TPOSTransactionRecoderCell.m
 */
"processing"="打包中";

/*
 TPOSMarketEditViewController.m
 */
"all_select"="全选";
"unselect"="全不选";
"delete_fail_retry"="删除失败，请重试";
"delete"="删除";

/*
 TPOSMarketViewController.m
 */
"no_token_go_add"="您还没有代币，赶紧去添加吧~";

/*
 TPOSMarketSearchViewController.m
 */
"search_token_market"="搜索代币行情";
"add_fail"="添加失败";
"hot_rec"="热门推荐";

/*
 TPOSJTManager.m
 */
"missing_param"="缺少参数";
"sign_failed"="本地签名失败";

/*
 TPOSAuthPasswordViewController.m
 */
"set_pwd"="请先设置密码";
"repeat_pwd"="请再次输入密码";
"input_pwd_auth"="请输入密码，以验证身份";
"contact_us"="出问题了，赶紧和我们联系吧";
"wrong_pwd"="密码不正确，请重新输入";
"no_deviceId"="对不起，当前设备不支持指纹/面部ID";
"deviceId_wrong"="指纹/面部ID不正确，验证失败";
"auth_failed"="验证失败";
"auth_fail_to_pwd"="多次错误，指纹/面部ID已被锁定，请到手机解锁界面输入密码";
"setting_succ"="设置成功";

/*
 TPOSForceCreateWalletViewController.m
 */
"usr_agreement"="用户协议";

/*
 TPOSEnterAuthViewController.m
 */
"auth_pwd"="密码验证";
"touch_pwd"="点击进行密码验证";
"touch_touchId"="点击唤醒指纹验证";
"touch_faceId"="点击唤醒面部验证";

/*
 AppDelegate.m
 */
"update_tips"="Token Pocket已更新，有更棒的体验和功能，快快下载吧~";
"go_download"="前往下载";

/*
 JHPieChart.m
 */
"amount"="数量";
"rate"="占比";

/*
 TPOSAuthID.m
 */
"input_pwd"="输入密码";
"auth_with_touchId"="通过Home键验证已有指纹";
/*
 TPOSTransactionEmptyView
 */
"soon"="敬请期待";
"de_exchange"="去中心化的全球数字资产交易所";

/*
 TPOSMarketHeader.h
 */
"now_price"="最新价";
"change_ratio"="涨跌幅";
"no_market_tendency"="當前暫無行情";
"add_tendency"="添加行情";

"pay_wallet"="付款钱包";
"trans_out"="转入地址";
"trans_info"="订单信息";
"trans_detail"="支付详情";
"confirm_trans"="确认支付";

"fee_setting"="矿工费设置";
"gas_slow"="慢";
"gas_fast"="快";
"gas_rec"="推荐";

"wallet_delete"="删除钱包";
"wallet_name"="钱包名称";
"wallet_addr"="钱包地址";
"change_pwd"="修改密码";
"export_pk"="导出私钥";
"addr_copy"="复制";

"pwd_curr"="当前密码";
"pwd_new"="新密码";
"pwd_repeat"="确认密码";
"pwd_forget"="忘记密码？导入私钥可重置密码。";
"import_imid"="马上导入";

"pla_pwd_curr"="当前密码";
"pla_pwd_new"="新密码";
"pla_pwd_repeat"="确认密码";

"total_asset_title"="总资产";
"title_share_to"="分享到";
"title_button_cancel"="取消";
"wx_frnds"="微信好友";
"wx_timeline"="朋友圈";
"share_qq"="QQ";

"backup_wallet_line"="为了您钱包 %@ 的安全";
"backup_tips"="请备份私钥或助记词";

"tip_one"="密码用于保护私钥和交易授权，强度非常重要";
"tip_two"="TokenPocket不存储密码，也无法帮您找回，请务必牢记";

"wallet_foundation"="钱包体系";
"wallet_name"="钱包名称";
"set_pwd"="设置密码";
"repeat_pwd"="确认密码";
"pwd_hint"="提示信息";
"pwd_optional"="可不填";
"read_agree"="我已仔细阅读并同意";
"input_private_key"="请输入明文私钥";
"input_mnemonic_words"="请输入助记词，按空格做分隔";
"import_start"="开始导入";

"pwd_length_tip"="不少于8位字符，建议混合大小写字母、数字、特殊符号";
"pwd_length_weak"="密码强度太低，极易被黑客破解";

"mnemonic_write_down"="抄写下你的钱包助记词";
"confirm_mnemonic_title"="确认你的钱包助记词";
"confirm_mnemonic_desc"="请按顺序点击助记词，验证您备份的助记词是否正确。";
"entry_agree"="进入即代表同意服务协议和隐私条款";
"tap_reauth"="点击再次认证";

"send_trans_fail"="发生交易失敗";
"desc_wrong_pwd"="密码不正确";

"backup_wallet_line_prefix"="为了您钱包 ";
"backup_wallet_line_suffix"=" 的安全";
"backup_tips"="请备份私钥或助记词";
"backup_now"="立即备份";

"read_first"="请阅读并同意服务条款";
"illegal_mnem"="非法助记词，请检查";
"about_us_desc"="Token Pocket是一款移动端轻钱包APP，它旨在为普通用户提供一款安全放心、简单好用、功能强大的数字资产钱包。";
